design_model/src/main/resources/行为型模式/中介者模式/中介者模式.md
```mermaid
classDiagram
    class ConcreteColleagueA {
        <<具体同事类>>
    }
    class ConcreteColleagueB {
        <<具体同事类>>
    }
    class ConcreteMediator {
        <<具体中介者>>
    }
    ConcreteColleagueA --|> Colleague
    ConcreteColleagueB --|> Colleague
    ConcreteMediator --|> Mediator
    Colleague --> Mediator : mediator
    ConcreteMediator --> ConcreteColleagueA
    ConcreteMediator --> ConcreteColleagueB
```
